RIET/src/Documents/ЗакрытиеСчетовНаПредоплату/ЗакрытиеСчетовНаПредоплату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеСчетовНаПредоплату</name>
  <registerRecords>AccumulationRegister.СчетаНаПредоплату</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнвойсинговыйЦентр</name>
    <type>
      <types>CatalogRef.ИнвойсинговыеЦентры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Счета</name>
    <attributes>
      <name>СчетНаОплату</name>
      <type>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/AccumulationRegisters/СчетаНаПредоплату/СчетаНаПредоплату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СчетаНаПредоплату</name>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Enums/ВидыОперацийСчетНаОплатуПокупателю/ВидыОперацийСчетНаОплатуПокупателю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийСчетНаОплатуПокупателю</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПредоплатаПоДоговору</name>
  </enumValues>
  <enumValues>
    <name>СчетНаОплату</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/ЗакрытиеСчетовНаПредоплату/ObjectModule.bsl
//Добавил РГ-Софт - Пронин Иван
Перем мУдалятьДвижения;
//Конец добавления

Процедура ОбработкаПроведения(Отказ, Режим)
	//Добавил РГ-Софт - Пронин Иван
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ,, Истина);
	КонецЕсли;
	//Конец добавления
	
	Для Каждого ТекСтрокаСчета Из Счета Цикл

		Если  ТекСтрокаСчета.СчетНаОплату.ВидОперации = Перечисления.ВидыОперацийСчетНаОплатуПокупателю.СчетНаОплату Тогда
			
			Сообщить("Счет "+ ТекСтрокаСчета.СчетНаОплату + " не является счетом на предоплату!");
			Отказ=Истина;
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если не Отказ Тогда
	Для Каждого ТекСтрокаСчета Из Счета Цикл
		// register СчетаНаПредоплату Расход
		Движение = Движения.СчетаНаПредоплату.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ПодразделениеОрганизации = ПодразделениеОрганизации;
		Движение.ДоговорКонтрагента = ДоговорКонтрагента;
		Движение.СчетНаОплату = ТекСтрокаСчета.СчетНаОплату;
		Движение.СуммаРегл = ТекСтрокаСчета.СуммаВзаиморасчетов*ТекСтрокаСчета.КурсВзаиморасчетов;
		Движение.СуммаВзаиморасчетов = ТекСтрокаСчета.СуммаВзаиморасчетов;
	КонецЦикла;
	// writing register movements
	Движения.СчетаНаПредоплату.Записать();
    КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры

//Добавил РГ-Софт - Пронин Иван
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ,, Истина);
	
КонецПроцедуры
